[M_Orchid_FreedomOfSpeech MissionDefinition]
MissionDescription="You found a malfunctioning Hyperion loader named C3n50r807 in the [place]Washburne Refinery[-place]. He seems to be obsessed with censoring all ''immoral'' behavior on Pandora. In this instance, the censorbot has asked you to wage war on the concept of profanity. A bandit DJ plans on broadcasting a stream of profanity from a radio tower -- the censorbot has asked you to find the DJ, and kill him before he can curse on the air."
TurnInDescription="Pandora may be full of murder, theft, and cannibalism, but you have at least ensured that no one will be using inappropriate language."
MissionSummary="Censor the DJ. With bullets."
MissionGiver="C3n50r807"
MissionTurnInLocation="C3n50r807"

[M_Orchid_FreedomOfSpeech:ReturnToCensorbot MissionObjectiveDefinition]
ProgressMessage="Return to C3n50r807"
